/*
1. Считать данные из входного файла.
2. Для каждой детали произвести поиск подходящей пары половинок формы.
3. Для каждой пары половинок формы проверить, соответствует ли она данной детали.
4. Если подходящая пара половинок формы найдена, то записать номера этих половинок в выходной файл для данной детали.
5. Если подходящая пара половинок формы не найдена, вывести сообщение об ошибке и завершить программу.
*/
namespace Forms
{
    internal class Program
    {
        static void Main()
        {
            
        }
    }
}