/*
 Создать трехмерный массив, представляющий кубик Рубика, заполненный числами от 1 до N^3.

Считать начальные координаты элемента кубика (XN, YN, ZN) из входного файла.

Пройти по каждой строке входного файла, выполняя соответствующее вращение блоков кубика.

Для каждого вращения блоков кубика, вычислить индексы блоков, которые будут затронуты вращением, и выполнить само вращение.

Найти новые координаты элемента кубика после всех вращений и вывести их в выходной файл.
 */
namespace Kybik_rubik
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}